In [2]:
import pandas as pd

In [107]:
# Задача 1

df = pd.DataFrame({"CLIENT": ['1', '1', '2', '2', '3'],
                   "HYPERMARKET": ['1055', '1010', '1030', '1125', '1099'],
                   "DATE": ['20190301', '20190328', '20190415','20190403', '20190501']})

In [108]:
df

  CLIENT HYPERMARKET      DATE
0      1        1055  20190301
1      1        1010  20190328
2      2        1030  20190415
3      2        1125  20190403
4      3        1099  20190501

In [109]:
df.DATE= pd.to_datetime(df.DATE)

In [110]:
temp = df.groupby('CLIENT', as_index=False).agg({'DATE':'max', 'HYPERMARKET':'count'})

In [111]:
temp = temp.rename(columns = {'HYPERMARKET':'STORES_VISITED_NUM'})

In [112]:
result = temp.merge(df, on=['CLIENT', 'DATE'], how='left')

In [113]:
result = result.rename(columns = {'HYPERMARKET':'LAST_STORE'})
result = result.drop(columns = ['DATE'])

In [116]:
result

  CLIENT  STORES_VISITED_NUM LAST_STORE
0      1                   2       1010
1      2                   2       1030
2      3                   1       1099

In [ ]:
# Задача 2

In [47]:
A_1 = pd.DataFrame({"CLIENT": ['1', '8', '2', '3', '4'],
                   "SALES": ['1055', '1010', '1030', '1125', '1099']})
A_2 = pd.DataFrame({"CLIENT": ['5', '1', '4', '2', '3'],
                   "SALES": ['1055', '1010', '1030', '1125', '1099']})

In [48]:
A_1

  CLIENT SALES
0      1  1055
1      8  1010
2      2  1030
3      3  1125
4      4  1099

In [49]:
A_2

  CLIENT SALES
0      5  1055
1      1  1010
2      4  1030
3      2  1125
4      3  1099

In [50]:
A_1 = A_1.drop(columns = ['SALES'])
A_2 = A_2.drop(columns = ['SALES'])

In [51]:
diff_A_2 = set(A_2.CLIENT).difference(A_1.CLIENT)
diff_A_1 = set(A_1.CLIENT).difference(A_2.CLIENT)

In [52]:
where_diff_2 = A_2.CLIENT.isin(diff_A_2)
where_diff_1 = A_1.CLIENT.isin(diff_A_1)

In [53]:
result = pd.concat([A_2[where_diff_2], A_1[where_diff_1]], ignore_index=True )

In [54]:
result

  CLIENT
0      5
1      8